#!/usr/bin/env python
# -*- coding: utf-8 -*-
# Author  : HalsignRay

from __future__ import unicode_literals
from PublicData import *


# 测试数据
errSymbol = "'"

policyTD = {
    'nameE': errSymbol,
    'nameR': getString(allSymbolTD, errSymbol)
}

# 策略管理界面信息
policyUI = {
    'title1': '设备策略',
    'title2': '新建一个设备策略',
    'title3': '查看或编辑该设备策略',
    'title4': '删除该设备策略',
    'title5': '新建设备策略',
    'title6': '编辑设备策略',
    'title7': '将鼠标悬浮在设备头上，会显示该所有的设备',
    'title8': '用户策略',
    'title9': '新建一个用户策略',
    'title10': '查看或者修改用户策略',
    'title11': '删除用户策略',
    'title13': '新建用户策略',
    'title14': '编辑用户策略',
    'title15': '用户只能对虚拟机做最基本的操作，比如开关机等',
    'title16': '将鼠标悬浮在用户规则上面，会显示所有的用户规则',
    'tableH1': ['策略名称', '类型', '设备', '设备数量', '创建人', '操作'],
    'tableH2': ['设备名称', '设备类型'],
    'tableH3': ['策略名称', '用户规则', '规则数量', '操作'],
    'tableD1': ['默认策略', '黑名单', '无限制', '无限制', '管理员'],
    'UplyD': ['手动还原系统', '配置虚拟机', '添加删除虚拟机'],
    'USB': ['USB存储设备', 'usb存储设备'],
    'CD': ['光驱设备', '光驱'],
    'VCD': ['虚拟光驱设备', '光驱'],
    'tabelT': ['USB存储设备, 比如U盘、移动硬盘', 'CD/DVD光驱', '虚拟CD/DVD光驱'],
    'labelL1': ['基本信息', '* 策略名称', '策略类型', '* 请选择设备', '策略说明', '说明'],
    'labelL2': ['* 策略名称', '* 用户规则', '策略说明'],
    'labelL3': ['备选', '已选'],
    'ruleL': ['手动生成快照', '强制更新镜像', '多点同时在线', '手动还原系统', '自动还原系统', '修改用户密码', '配置虚拟机', '添加删除虚拟机', '用户数据漫游', '系统数据漫游'],
    'button1': '新建策略',
    'srcBar': '策略名称',
    'policyD': '默认策略',
    'noRule': '无',
    'len1': '64',
    'Dtype': ['黑名单', '白名单'],
    'err1': '策略名称不能为空！',
    'err2': '策略名称不能包含单引号！',
    'err3': '选择数据漫游时，不能同时选择多点登录，多点登录被取消',
    'err4': '选择多点登录时，不能同时选择数据漫游，数据漫游被取消',
    'err5': '策略名称已存在！',
    'err6': '设备不能为空！',

}

# 策略界面Box信息
policyBox = {
    'msg1': '您确定删除该策略吗？',
    'msg2': '该策略已经分配给了用户，不能直接删除！',
    'msg3': '该策略已经分配给了虚拟机，不能直接删除！',
}
