#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Date    : 2017-06-29 10:12:01
# @Author  : HalsignRay
# @Email   : 321134890@qq.com


from __future__ import unicode_literals


# vTop日志管理
vtoplogUI = {
    'title1': 'vTop日志',
    'title2': '删除选中的日志',
    'button1': '删除',
    'button2': '应用',
    'button3': '取消',
    'labelL1': ['虚拟机名称', '执行时间'],
    'labelL2': ['从', '至'],
    'tableH': ['开始时间', '结束时间', '虚拟机名称', '虚拟机uuid', '类型', '状态']
}

# 系统日志
syslogUI = {
    'title1': '系统日志',
    'title2': '删除选中的日志',
    'button1': '删除',
    'button2': '应用',
    'button3': '取消',
    'labelL1': ['模块', '操作人员', '操作类型', '备注', '操作时间'],
    'labelL2': ['从', '至'],
    'tableH': ['操作人员', '操作时间', '操作类型', '备注'],
    'selectL2': ['全部', '添加', '删除', '修改'],
    'selectL1': ['全部', '接口日志', '用户管理-用户', 'vTop管理-vTop', '用户管理-用户组', '资源管理-设备', '资源管理-用户规则', '资源管理-网络', '策略管理-用户策略', '策略管理-设备策略', '资源管理-命名规则', '策略管理-隔离策略', '权限管理-机构管理', '权限管理-用户管理', '资源管理-镜像', 'vTop管理-虚拟机', 'vTop管理-位置', '资源管理-IP规则', '资源管理-升级包', '同步镜像', '集中管理'],
    'msg1': '您确定删除选中的日志吗？'
}

# 日志管理界面Box
logBox = {
    'msg1': '至少选择一条日志'
}